_Rarzrabotki/BASEBuh/Documents/СогласованиеПеремещения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Document>
		<Properties>
			<Name>СогласованиеПеремещения</Name>
			<Comment>(Общ)</Comment>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыОперацийПеремещениеТоваров</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладОтправитель</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладПолучатель</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Comment>(Общ)</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Comment>(Общ) Любая дополнительная информация</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РучнаяКорректировка</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отпустил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Получил</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Направление</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Направления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
					<Comment>(Общ)</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Comment>(Общ) Розничная цена в розничной торговле</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаВРознице</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаВРознице</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтавкаНДСВРознице</Name>
							<Comment>(Общ) </Comment>
							<Type>
								<v8:Type>cfg:EnumRef.СтавкиНДС</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДокументОприходования</Name>
							<Type>
								<v8:Type>cfg:DocumentRef.ОтчетПроизводстваЗаСмену</v8:Type>
								<v8:Type>cfg:DocumentRef.АвансовыйОтчет</v8:Type>
								<v8:Type>cfg:DocumentRef.ОприходованиеТоваров</v8:Type>
								<v8:Type>cfg:DocumentRef.ДокументРасчетовСКонтрагентом</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеТоваровУслуг</v8:Type>
								<v8:Type>cfg:DocumentRef.СогласованиеПеремещения</v8:Type>
								<v8:Type>cfg:DocumentRef.ВозвратТоваровОтПокупателя</v8:Type>
								<v8:Type>cfg:DocumentRef.КомплектацияНоменклатуры</v8:Type>
								<v8:Type>cfg:DocumentRef.ПоступлениеИзПереработки</v8:Type>
								<v8:Type>cfg:DocumentRef.Партия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Остаток</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТоварыНаКомиссии</Name>
					<Comment>(Общ)</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Comment>(Общ) Розничная цена в розничной торговле</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчетаБУ</Name>
							<Comment>(Регл)</Comment>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НовыйСчетУчетаБУ</Name>
							<Comment>(Регл)</Comment>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Остаток</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВозвратнаяТара</Name>
					<Comment>(Общ)</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчетаБУ</Name>
							<Comment>(Регл)</Comment>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НовыйСчетУчетаБУ</Name>
							<Comment>(Регл)</Comment>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НалоговоеНазначение</Name>
							<Comment>(Регл)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.НалоговыеНазначенияАктивовИЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>БланкиСтрогогоУчета</Name>
					<Comment>(Общ)</Comment>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЕдиницаИзмерения</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификаторЕдиницИзмерения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Коэффициент</Name>
							<Comment>(Общ)</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Comment>(Общ) Розничная цена в розничной торговле</Comment>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчетаБУ</Name>
							<Comment>(Регл)</Comment>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НовыйСчетУчетаБУ</Name>
							<Comment>(Регл)</Comment>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетУчетаЗабалансовыйБУ</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НовыйСчетУчетаЗабалансовыйБУ</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НалоговоеНазначение</Name>
							<Comment>(Регл)</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.НалоговыеНазначенияАктивовИЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

_Rarzrabotki/BASEBuh/Enums/ДополнительнаяКолонкаПечатныхФормДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ДополнительнаяКолонкаПечатныхФормДокументов</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НеВыводить</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Артикул</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Код</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/BASEBuh/Enums/ТипыСкладов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ТипыСкладов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОптовыйСклад</Name>
					<Comment>Оптовый склад</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РозничныйМагазин</Name>
					<Comment>Розничный</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НеавтоматизированнаяТорговаяТочка</Name>
					<Comment>Неавтоматизированная торговая точка</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/BASEBuh/Enums/СпособыОценкиТоваровВРознице.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>СпособыОценкиТоваровВРознице</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ПоСтоимостиПриобретения</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПоПродажнойСтоимости</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/BASEBuh/Enums/ВидыОперацийПеремещениеТоваров.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Enum>
		<Properties>
			<Name>ВидыОперацийПеремещениеТоваров</Name>
			<Comment>(Общ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ТоварыПродукция</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оборудование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>БланкиСтрогогоУчета</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

_Rarzrabotki/BASEBuh/Documents/СогласованиеПеремещения/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПроцедурыИФункцииПечати

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	// Накладная на перемещение товаров
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "Согласование";
	КомандаПечати.Представление = НСтр("ru='Согласование перемещения товаров';uk='Погодження переміщення товарів'");
	КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	КомандаПечати.СписокФорм    = "ФормаСписка,ФормаВыбора,ФормаДокументаОбщая";
	КомандаПечати.Порядок       = 1;
	
	
	//// Накладная на перемещение товаров (М-11)
	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.Идентификатор = "М11";
	//КомандаПечати.Представление = НСтр("ru='Накладная на перемещение товаров (М-11)';uk='Накладна на переміщення товарів (М-11)'");
	//КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечати";
	//КомандаПечати.СписокФорм    = "ФормаСписка,ФормаВыбора,ФормаДокументаОбщая";
	//КомандаПечати.Порядок       = 2;
	//
	//// Товарно-транспортная накладная (1-ТН)
	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.МенеджерПечати = "Обработка.ПечатьТТН";
	//КомандаПечати.Идентификатор = "ТТН";
	//КомандаПечати.Представление = НСтр("ru='Товарно-транспортная накладная (1-ТН)';uk='Товарно-транспортна накладна (1-ТН)'");
	//КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ОткрытьФормуПечатиТТН";
	//КомандаПечати.СписокФорм    = "ФормаСписка,ФормаВыбора,ФормаДокументаОбщая";	
	//КомандаПечати.Порядок       = 3;
	//
	//// Реестр документов
	//КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.Идентификатор = "Реестр";
	//КомандаПечати.Представление = НСтр("ru='Реестр документов';uk='Реєстр документів'");
	//КомандаПечати.ЗаголовокФормы= НСтр("ru='Реестр документов ""Перемещение товаров""';uk='Реєстр документів ""Переміщення товарів""'");
	//КомандаПечати.Обработчик    = "УправлениеПечатьюБПКлиент.ВыполнитьКомандуПечатиРеестраДокументов";
	//КомандаПечати.СписокФорм    = "ФормаСписка";
	//КомандаПечати.Порядок       = 100;

КонецПроцедуры // ДобавитьКомандыПечати

// Функция формирует табличный документ с печатной формой накладной на перемещение товаров, разработанной методистами
//
// Возвращаемое значение:
//  Табличный документ - печатная форма накладной
//
Функция ПечатьСогласованиеПеремещения(МассивОбъектов, ОбъектыПечати, ПараметрыВывода)

	УстановитьПривилегированныйРежим(Истина);	
	
	мВалютаРегламентированногоУчета = ОбщегоНазначенияБПВызовСервераПовтИсп.ПолучитьВалютуРегламентированногоУчета();
	
	ДопКолонка = Константы.ДополнительнаяКолонкаПечатныхФормДокументов.Получить();
	Если ДопКолонка = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.Артикул Тогда
		ВыводитьКоды = Истина;
		Колонка = "Артикул";
	ИначеЕсли ДопКолонка = Перечисления.ДополнительнаяКолонкаПечатныхФормДокументов.Код Тогда
		ВыводитьКоды = Истина;
		Колонка = "Код";
	Иначе
		ВыводитьКоды = Ложь;
	КонецЕсли;
	
	ЗапросДокумент = Новый Запрос;
	ЗапросДокумент.Текст = "ВЫБРАТЬ
	                       |	СогласованиеПеремещения.Номер КАК Номер,
	                       |	СогласованиеПеремещения.Дата КАК Дата,
	                       |	СогласованиеПеремещения.Организация КАК Организация,
	                       |	СогласованиеПеремещения.СкладОтправитель КАК СкладОтправитель,
	                       |	СогласованиеПеремещения.СкладОтправитель.Представление КАК Поставщик,
	                       |	СогласованиеПеремещения.СкладПолучатель КАК СкладПолучатель,
	                       |	СогласованиеПеремещения.СкладОтправитель.ТипСклада КАК ТипСкладаОтправитель,
	                       |	СогласованиеПеремещения.СкладПолучатель.ТипСклада КАК ТипСкладаПолучатель,
	                       |	СогласованиеПеремещения.СкладОтправитель.ТипЦенРозничнойТорговли КАК ТипЦенРозничнойТорговлиОтправитель,
	                       |	СогласованиеПеремещения.СкладПолучатель.ТипЦенРозничнойТорговли КАК ТипЦенРозничнойТорговлиПолучатель,
	                       |	СогласованиеПеремещения.СкладПолучатель.Представление КАК Покупатель,
	                       |	СогласованиеПеремещения.Отпустил КАК Отпустил,
	                       |	СогласованиеПеремещения.Получил КАК Получил
	                       |ИЗ
	                       |	Документ.СогласованиеПеремещения КАК СогласованиеПеремещения
	                       |ГДЕ
	                       |	СогласованиеПеремещения.Ссылка = &ТекущийДокумент";
	
	ЗапросДокумент.УстановитьПараметр("НТТ", Перечисления.ТипыСкладов.НеавтоматизированнаяТорговаяТочка);
	
	ЗапросПоТоварам = Новый Запрос;
	ЗапросПоТоварам.Текст = 
	   "ВЫБРАТЬ
	   |	СогласованиеПеремещенияТовары.НомерСтроки КАК НомерСтроки,
	   |	СогласованиеПеремещенияТовары.Номенклатура КАК Товар,
	   |	СогласованиеПеремещенияТовары.ЕдиницаИзмерения КАК ЕдиницаИзмерения,
	   |	СогласованиеПеремещенияТовары.Количество КАК Количество,
	   |	СогласованиеПеремещенияТовары.Номенклатура.Код КАК Код
	   |ИЗ
	   |	Документ.СогласованиеПеремещения.Товары КАК СогласованиеПеремещенияТовары
	   |ГДЕ
	   |	СогласованиеПеремещенияТовары.Ссылка = &ТекущийДокумент
	   |
	   |ОБЪЕДИНИТЬ ВСЕ
	   |
	   |ВЫБРАТЬ
	   |	СогласованиеПеремещенияТоварыНаКомиссии.НомерСтроки,
	   |	СогласованиеПеремещенияТоварыНаКомиссии.Номенклатура,
	   |	СогласованиеПеремещенияТоварыНаКомиссии.ЕдиницаИзмерения,
	   |	СогласованиеПеремещенияТоварыНаКомиссии.Количество,
	   |	СогласованиеПеремещенияТоварыНаКомиссии.Номенклатура.Код
	   |ИЗ
	   |	Документ.СогласованиеПеремещения.ТоварыНаКомиссии КАК СогласованиеПеремещенияТоварыНаКомиссии
	   |ГДЕ
	   |	СогласованиеПеремещенияТоварыНаКомиссии.Ссылка = &ТекущийДокумент";
		
	ТабДокумент = Новый ТабличныйДокумент;
	ТабДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_СогласованиеПеремещения_Накладная";

	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.СогласованиеПеремещения.ПФ_MXL_Накладная");
	
	// печать производится на языке, указанном в настройках пользователя
	КодЯзыкаПечать = ПараметрыВывода.КодЯзыкаДляМногоязычныхПечатныхФорм;
	Макет.КодЯзыкаМакета = КодЯзыкаПечать;

	ПервыйДокумент = Истина;
	
	ОбластьКолонкаТоварШиринаКолонки = Макет.Область("Товар").ШиринаКолонки;
	ОбластьКолонкаКодовШиринаКолонки = Макет.Область("КолонкаКодов").ШиринаКолонки;
	
	Для Каждого Ссылка Из МассивОбъектов Цикл	
		
		Если Не ПервыйДокумент Тогда
			ТабДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		
		ПервыйДокумент = Ложь;
		
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабДокумент.ВысотаТаблицы + 1;
		
		ЗапросДокумент.УстановитьПараметр("ТекущийДокумент", Ссылка);
		
		Шапка = ЗапросДокумент.Выполнить().Выбрать();

		Шапка.Следующий();
		
		СпособОценкиТоваровВРознице = УчетнаяПолитика.СпособОценкиТоваровВРознице(Шапка.Организация, НачалоМесяца(Шапка.Дата));
		мУчетВПродажныхЦенах = (СпособОценкиТоваровВРознице = Перечисления.СпособыОценкиТоваровВРознице.ПоПродажнойСтоимости);

		//СкладНТТ = Шапка.ОтправительНТТ ИЛИ Шапка.ПолучательНТТ;
		//ЕстьЦена = мУчетВПродажныхЦенах И НЕ (Шапка.ТипСкладаОтправитель = Перечисления.ТипыСкладов.ОптовыйСклад И Шапка.ТипСкладаПолучатель = Перечисления.ТипыСкладов.ОптовыйСклад); 
		
		// Выводим шапку накладной
		ОбластьМакета = Макет.ПолучитьОбласть("Заголовок");
		ОбластьМакета.Параметры.ТекстЗаголовка = ОбщегоНазначенияБПВызовСервера.СформироватьЗаголовокДокумента(Шапка, НСтр("ru='Согласование перемещения';uk='Погодження переміщення'", КодЯзыкаПечать), КодЯзыкаПечать);
		ТабДокумент.Вывести(ОбластьМакета);

		СведенияОбОрганизации = БухгалтерскийУчетПереопределяемый.СведенияОЮрФизЛице(Шапка.Организация, Шапка.Дата,,,КодЯзыкаПечать);
		ОбластьМакета = Макет.ПолучитьОбласть("Организация");
		ОбластьМакета.Параметры.Заполнить(Шапка);
		ОбластьМакета.Параметры.ПредставлениеПоставщика = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОбОрганизации, "ПолноеНаименование,",,КодЯзыкаПечать);	
		ОбластьМакета.Параметры.РеквизитыПоставщика     = ОбщегоНазначенияБПВызовСервера.ОписаниеОрганизации(СведенияОбОрганизации, "ЮридическийАдрес,Телефоны,/,КодПоЕДРПОУ,КодПоДРФО,",,КодЯзыкаПечать);
		ТабДокумент.Вывести(ОбластьМакета);
		
		ОбластьМакета = Макет.ПолучитьОбласть("Поставщик");
		ОбластьМакета.Параметры.ПредставлениеПоставщика = Шапка.Поставщик;
		ОбластьМакета.Параметры.Поставщик = Шапка.СкладОтправитель;
		ТабДокумент.Вывести(ОбластьМакета);

		ОбластьМакета = Макет.ПолучитьОбласть("Покупатель");
		ОбластьМакета.Параметры.ПредставлениеПолучателя = Шапка.Покупатель;
		ОбластьМакета.Параметры.Получатель = Шапка.СкладПолучатель;
		ТабДокумент.Вывести(ОбластьМакета);

		ОбластьШапки  = "ШапкаТаблицы";
		ОбластьСтроки = "Строка";

		ОбластьНомера = Макет.ПолучитьОбласть(ОбластьШапки+"|НомерСтроки");
		ОбластьКодов  = Макет.ПолучитьОбласть(ОбластьШапки+"|КолонкаКодов");
		ОбластьДанных = Макет.ПолучитьОбласть(ОбластьШапки+"|Данные");
		ОбластьЦены   = Макет.ПолучитьОбласть(ОбластьШапки+"|Цена");
		
		ТабДокумент.Вывести(ОбластьНомера);
		Если ВыводитьКоды Тогда
			ОбластьКодов.Параметры.ИмяКолонкиКодов = Колонка;
			ТабДокумент.Присоединить(ОбластьКодов);
		КонецЕсли;
		ТабДокумент.Присоединить(ОбластьДанных);
		//Если ЕстьЦена Тогда
		//	ТабДокумент.Присоединить(ОбластьЦены);
		//КонецЕсли; 
		
		ОбластьКолонкаТовар = Макет.Область("Товар");

		Если Не ВыводитьКоды Тогда
			ОбластьКолонкаТовар.ШиринаКолонки = ОбластьКолонкаТоварШиринаКолонки + ОбластьКолонкаКодовШиринаКолонки;
		КонецЕсли;
		
		ОбластьНомера = Макет.ПолучитьОбласть(ОбластьСтроки+"|НомерСтроки");
		ОбластьКодов  = Макет.ПолучитьОбласть(ОбластьСтроки+"|КолонкаКодов");
		ОбластьДанных = Макет.ПолучитьОбласть(ОбластьСтроки+"|Данные");
		ОбластьЦены   = Макет.ПолучитьОбласть(ОбластьСтроки+"|Цена");
		
		ЗапросПоТоварам.УстановитьПараметр("ТекущийДокумент", Ссылка);
		ВыборкаСтрокТовары = ЗапросПоТоварам.Выполнить().Выбрать();
	
		НомерСтрокиВыборки = 1;
		ИтогоСумма = 0;
		
		Пока ВыборкаСтрокТовары.Следующий() Цикл

			Если НЕ ЗначениеЗаполнено(ВыборкаСтрокТовары.Товар) Тогда
				Сообщить(НСтр("ru='В одной из строк не заполнено значение номенклатуры - строка при печати пропущена.';uk='В одному з рядків не заповнене значення номенклатури - рядок під час друку буде пропущений.'"), СтатусСообщения.Важное);
				Продолжить;
			КонецЕсли;

			ОбластьНомера.Параметры.НомерСтроки = НомерСтрокиВыборки;
			ТабДокумент.Вывести(ОбластьНомера);

			Если ВыводитьКоды Тогда
				Если Колонка = "Артикул" Тогда
					ОбластьКодов.Параметры.Артикул = ВыборкаСтрокТовары.Артикул;
				Иначе
					ОбластьКодов.Параметры.Артикул = ВыборкаСтрокТовары.Код;
				КонецЕсли;
				ТабДокумент.Присоединить(ОбластьКодов);
			КонецЕсли;
			
			ОбластьДанных.Параметры.Заполнить(ВыборкаСтрокТовары);
			ОбластьДанных.Параметры.Товар = СокрЛП(ВыборкаСтрокТовары.Товар);
			ТабДокумент.Присоединить(ОбластьДанных);
			//Если ЕстьЦена Тогда
			//	// Определим цену для розницы в продажных ценах
			//	КоличествоТов = ВыборкаСтрокТовары.Количество;
			//	ЦенаПеремещения = 0;
			//	Если (ВыборкаСтрокТовары.ID = 1) И СкладНТТ Тогда
			//		ЦенаПеремещения = ВыборкаСтрокТовары.Цена;
			//	ИначеЕсли (ВыборкаСтрокТовары.ID = 1) Тогда
			//		// один из складов - розничный
			//		Склад = ?(Шапка.ТипСкладаОтправитель = Перечисления.ТипыСкладов.РозничныйМагазин, Шапка.СкладОтправитель, Шапка.СкладПолучатель);
			//		ТипЦенРозничнойТорговли = ?(Шапка.ТипСкладаОтправитель = Перечисления.ТипыСкладов.РозничныйМагазин, Шапка.ТипЦенРозничнойТорговлиОтправитель, Шапка.ТипЦенРозничнойТорговлиПолучатель);
			//		ЦенаПеремещения = Ценообразование.ПолучитьЦенуНоменклатуры(ВыборкаСтрокТовары.Номенклатура, ТипЦенРозничнойТорговли, 
			//																	Шапка.Дата, мВалютаРегламентированногоУчета, 1, 1);
			//	КонецЕсли; 
			//	
			//	//Сумма = ЦенаПеремещения * КоличествоТов;
			//	//
			//	//ОбластьЦены.Параметры.Цена  = ЦенаПеремещения;
			//	//ОбластьЦены.Параметры.Сумма = Сумма;
			//	//ТабДокумент.Присоединить(ОбластьЦены);
			//	//ИтогоСумма = ИтогоСумма + Сумма;
			//	
			//КонецЕсли; 
			
			НомерСтрокиВыборки = НомерСтрокиВыборки + 1;
			
		КонецЦикла;

		// Подвал
		ОбластьНомера = Макет.ПолучитьОбласть("Подвал|НомерСтроки");
		ОбластьКодов  = Макет.ПолучитьОбласть("Подвал|КолонкаКодов");
		ОбластьДанных = Макет.ПолучитьОбласть("Подвал|Данные");
		ОбластьЦены   = Макет.ПолучитьОбласть("Подвал|Цена");
		
		//ОбластьЦены.Параметры.ИтогоСумма = ИтогоСумма;
		
		ТабДокумент.Вывести(ОбластьНомера);
		Если ВыводитьКоды Тогда
			ТабДокумент.Присоединить(ОбластьКодов);
		КонецЕсли;
		ТабДокумент.Присоединить(ОбластьДанных);
		//Если ЕстьЦена Тогда
		//	ТабДокумент.Присоединить(ОбластьЦены);
		//КонецЕсли; 

		// Вывести подписи
		ОбластьМакета = Макет.ПолучитьОбласть("Подписи");
		ОбластьМакета.Параметры.Заполнить(Шапка);
		ТабДокумент.Вывести(ОбластьМакета);
		
		// В табличном документе зададим имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабДокумент, 
			НомерСтрокиНачало, ОбъектыПечати, Ссылка);
		
	КонецЦикла;	

	Возврат ТабДокумент;

КонецФункции // ПечатьПеремещениеТоваров()

Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	ПараметрыВывода.ДоступнаПечатьПоКомплектно = Истина;
	
	УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "Согласование", НСтр("ru='Согласование перемещения товаров';uk='Погодження переміщення товарів'"), 
	ПечатьСогласованиеПеремещения(МассивОбъектов, ОбъектыПечати, ПараметрыВывода),,"Документ.СогласованиеПеремещения.ПФ_MXL_Накладная", , Истина);
	
КонецПроцедуры // Печать

Функция ПолучитьДополнительныеРеквизитыДляРеестра() Экспорт
	
	Результат = Новый Структура("Информация", "СкладОтправитель");
	
	Возврат Результат;
	
КонецФункции

#КонецОбласти 

#Область ПрограммныйИнтерфейс

// Заполняет счета учета номенклатуры в табличной части документа
Процедура ЗаполнитьСчетаУчетаВТабличнойЧасти(Объект, ИмяТабличнойЧасти) Экспорт

	ТабличнаяЧасть = Объект[ИмяТабличнойЧасти];
	
	ДанныеОбъекта = Новый Структура("Дата, Организация, Склад");
	ЗаполнитьЗначенияСвойств(ДанныеОбъекта, Объект);
	
	ДанныеОбъекта.Склад = Объект.СкладОтправитель;
	СоответствиеСчетовУчета = БухгалтерскийУчетПереопределяемый.ПолучитьСчетаУчетаСпискаНоменклатуры(
		ДанныеОбъекта.Организация, ОбщегоНазначения.ВыгрузитьКолонку(ТабличнаяЧасть, "Номенклатура", Истина), ДанныеОбъекта.Склад, ДанныеОбъекта.Дата);
	
	ДанныеОбъекта.Склад = Объект.СкладПолучатель;
	СоответствиеНовыхСчетовУчета = БухгалтерскийУчетПереопределяемый.ПолучитьСчетаУчетаСпискаНоменклатуры(
		ДанныеОбъекта.Организация, ОбщегоНазначения.ВыгрузитьКолонку(ТабличнаяЧасть, "Номенклатура", Истина), ДанныеОбъекта.Склад, ДанныеОбъекта.Дата);
		
	Для каждого СтрокаТабличнойЧасти Из ТабличнаяЧасть Цикл
		СчетаУчета		= СоответствиеСчетовУчета.Получить(СтрокаТабличнойЧасти.Номенклатура);
		НовыеСчетаУчета	= СоответствиеНовыхСчетовУчета.Получить(СтрокаТабличнойЧасти.Номенклатура);
		ЗаполнитьСчетаУчетаВСтрокеТабличнойЧасти(ДанныеОбъекта, СтрокаТабличнойЧасти, ИмяТабличнойЧасти, СчетаУчета, НовыеСчетаУчета);
	КонецЦикла;

КонецПроцедуры // ЗаполнитьСчетаУчетаВТабличнойЧасти

Процедура ЗаполнитьСтрокиТабличнойЧастиТовары(Объект, ТипСкладаОтправитель, ТипСкладаПолучатель, РазделениеПоСтавкамВРознице) Экспорт

	СписокНоменклатуры	= ОбщегоНазначения.ВыгрузитьКолонку(Объект.Товары, "Номенклатура", Истина);
	
	ДанныеОбъекта = Новый Структура("Дата, Организация, Склад");
	ЗаполнитьЗначенияСвойств(ДанныеОбъекта, Объект);
	
	ДанныеОбъекта.Склад	= Объект.СкладОтправитель;
	СоответствиеСведенийОНоменклатуре = БухгалтерскийУчетПереопределяемый.ПолучитьСведенияОСпискеНоменклатуры(
		СписокНоменклатуры, ДанныеОбъекта);
	
	ДанныеОбъекта.Склад	= Объект.СкладПолучатель;
	СоответствиеНовыхСведенийОНоменклатуре = БухгалтерскийУчетПереопределяемый.ПолучитьСведенияОСпискеНоменклатуры(
		СписокНоменклатуры, ДанныеОбъекта);
		
	Для Каждого СтрокаТабличнойЧасти Из Объект.Товары Цикл
		
		СведенияОНоменклатуре		= СоответствиеСведенийОНоменклатуре.Получить(СтрокаТабличнойЧасти.Номенклатура);
		НовыеСведенияОНоменклатуре	= СоответствиеНовыхСведенийОНоменклатуре.Получить(СтрокаТабличнойЧасти.Номенклатура);
		
		Документы.ПеремещениеТоваров.ЗаполнитьСчетаУчетаВСтрокеТабличнойЧасти(
			ДанныеОбъекта, СтрокаТабличнойЧасти, "Товары", СведенияОНоменклатуре, НовыеСведенияОНоменклатуре);
			
		
		Если ТипСкладаОтправитель = Перечисления.ТипыСкладов.НеавтоматизированнаяТорговаяТочка Тогда
			
			Если РазделениеПоСтавкамВРознице И СведенияОНоменклатуре <> Неопределено Тогда
				СтрокаТабличнойЧасти.СтавкаНДСВРознице = СведенияОНоменклатуре.СтавкаНДСВРознице;
			КонецЕсли;
			
			Если ТипСкладаПолучатель = Перечисления.ТипыСкладов.ОптовыйСклад Тогда
				СтрокаТабличнойЧасти.ЦенаВРознице	= СведенияОНоменклатуре.ЦенаВРознице;
				СтрокаТабличнойЧасти.СуммаВРознице	= СведенияОНоменклатуре.ЦенаВРознице * СтрокаТабличнойЧасти.Количество;
			КонецЕсли;
			
		ИначеЕсли ТипСкладаПолучатель = Перечисления.ТипыСкладов.НеавтоматизированнаяТорговаяТочка Тогда
			
			Если РазделениеПоСтавкамВРознице И НовыеСведенияОНоменклатуре <> Неопределено Тогда
				СтрокаТабличнойЧасти.СтавкаНДСВРознице = НовыеСведенияОНоменклатуре.СтавкаНДСВРознице;
			КонецЕсли;
			
			Если ТипСкладаОтправитель = Перечисления.ТипыСкладов.ОптовыйСклад Тогда
				СтрокаТабличнойЧасти.ЦенаВРознице	= НовыеСведенияОНоменклатуре.ЦенаВРознице;
				СтрокаТабличнойЧасти.СуммаВРознице	= НовыеСведенияОНоменклатуре.ЦенаВРознице * СтрокаТабличнойЧасти.Количество;
			КонецЕсли;
			
		КонецЕсли;
		
	КонецЦикла;

КонецПроцедуры // ЗаполнитьСтрокиТабличнойЧастиТовары

Функция ЗаполнитьСчетУчетаТовараРозницаВПродажныхЦенах(СчетУчета, Знач ТипСклада) Экспорт
	Перем СчетУчетаРозницаВПродажныхЦенах;
	
	Если ТипСклада = Перечисления.ТипыСкладов.РозничныйМагазин Тогда
		СчетУчетаРозницаВПродажныхЦенах = ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахАТТ;
	ИначеЕсли ТипСклада = Перечисления.ТипыСкладов.НеавтоматизированнаяТорговаяТочка Тогда
		СчетУчетаРозницаВПродажныхЦенах = ПланыСчетов.Хозрасчетный.ТоварыВРозничнойТорговлеВПродажныхЦенахНТТ;
	Иначе
		СчетУчетаРозницаВПродажныхЦенах = СчетУчета;
	КонецЕсли;
	
	Если СчетУчета <> СчетУчетаРозницаВПродажныхЦенах Тогда
		СчетУчета = СчетУчетаРозницаВПродажныхЦенах;
	КонецЕсли;
	
КонецФункции // ЗаполнитьСчетУчетаТовараРозницаВПродажныхЦенах

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.ВерсионированиеОбъектов

// Определяет настройки объекта для подсистемы ВерсионированиеОбъектов.
//
// Параметры:
//  Настройки - Структура - настройки подсистемы.
Процедура ПриОпределенииНастроекВерсионированияОбъектов(Настройки) Экспорт

КонецПроцедуры

// Конец СтандартныеПодсистемы.ВерсионированиеОбъектов

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Заполняет счета учета номенклатуры в строке табличной части документа
//
// Параметры:
//  ДанныеОбъекта         - структура данных объекта, используемых при заполнении счетов учета (вид операции,
//                          вид договора контрагента, признак комиссионной торговли и т.п.)
//  СтрокаТабличнойЧасти  - строка табличной части документа
//  ИмяТабличнойЧасти     - имя табличной части документа
//  СведенияОНоменклатуре - структура сведений о номенклатуре, либо стуктура счетов учета
//
Процедура ЗаполнитьСчетаУчетаВСтрокеТабличнойЧасти(ДанныеОбъекта, СтрокаТабличнойЧасти, ИмяТабличнойЧасти, СведенияОНоменклатуре, НовыеСведенияОНоменклатуре, ЗаполнятьБУ = Истина, ЗаполнятьНУ = Истина) Экспорт
	
	Перем СчетаУчета, НовыеСчетаУчета;
	
	Если СведенияОНоменклатуре <> Неопределено Тогда
		
		Если СведенияОНоменклатуре.Свойство("СчетаУчета") Тогда
			// СведенияОНоменклатуре - структура сведений номенклатуры
			СчетаУчета = СведенияОНоменклатуре.СчетаУчета;
		ИначеЕсли СведенияОНоменклатуре.Свойство("СчетУчетаБУ") Тогда
			// СведенияОНоменклатуре - структура счетов учета номенклатуры
			СчетаУчета = СведенияОНоменклатуре;
		КонецЕсли;
		
	КонецЕсли;
	
	Если НовыеСведенияОНоменклатуре <> Неопределено Тогда
		
		Если НовыеСведенияОНоменклатуре.Свойство("СчетаУчета") Тогда
			// СведенияОНоменклатуре - структура сведений номенклатуры
			НовыеСчетаУчета = НовыеСведенияОНоменклатуре.СчетаУчета;
		ИначеЕсли НовыеСведенияОНоменклатуре.Свойство("СчетУчетаБУ") Тогда
			// СведенияОНоменклатуре - структура счетов учета номенклатуры
			НовыеСчетаУчета = НовыеСведенияОНоменклатуре;
		КонецЕсли;
		
	КонецЕсли;
	
	Если ЗаполнятьБУ Тогда
		ЗаполнитьСчетаБУ(СтрокаТабличнойЧасти, ИмяТабличнойЧасти, СчетаУчета, НовыеСчетаУчета);
	КонецЕсли; 
	Если ЗаполнятьНУ Тогда
		ЗаполнитьСчетаНУ(СтрокаТабличнойЧасти, ИмяТабличнойЧасти, СчетаУчета, НовыеСчетаУчета);
	КонецЕсли; 

КонецПроцедуры // ЗаполнитьСчетаУчетаВСтрокеТабличнойЧасти

// Заполняет счета БУ в строке табличной части.
Процедура ЗаполнитьСчетаБУ(СтрокаТабличнойЧасти, ИмяТабличнойЧасти, СчетаУчета, НовыеСчетаУчета)

	Если ВРег(ИмяТабличнойЧасти) <> Врег("ТоварыНаКомиссии") Тогда
	    СтрокаТабличнойЧасти.СчетУчетаБУ      = СчетаУчета.СчетУчетаБУ;
		СтрокаТабличнойЧасти.НовыйСчетУчетаБУ = НовыеСчетаУчета.СчетУчетаБУ;
		Если ВРег(ИмяТабличнойЧасти) = ВРег("БланкиСтрогогоУчета") Тогда
			СтрокаТабличнойЧасти.СчетУчетаЗабалансовыйБУ      = СчетаУчета.СчетУчетаДоп;
			СтрокаТабличнойЧасти.НовыйСчетУчетаЗабалансовыйБУ = НовыеСчетаУчета.СчетУчетаДоп;
		КонецЕсли;	
	Иначе
	    СтрокаТабличнойЧасти.СчетУчетаБУ      = СчетаУчета.СчетУчетаДоп;
		СтрокаТабличнойЧасти.НовыйСчетУчетаБУ = НовыеСчетаУчета.СчетУчетаДоп;
	КонецЕсли; 

КонецПроцедуры // ЗаполнитьСчетаБУ()

// Заполняет счета НУ в строке табличной части.
Процедура ЗаполнитьСчетаНУ(СтрокаТабличнойЧасти, ИмяТабличнойЧасти, СчетаУчета, НовыеСчетаУчета)
	
	Если ВРег(ИмяТабличнойЧасти) <> Врег("ТоварыНаКомиссии") Тогда
		СтрокаТабличнойЧасти.НалоговоеНазначение = СчетаУчета.НалоговоеНазначение;
	КонецЕсли;	

КонецПроцедуры // ЗаполнитьСчетаНУ()

Функция ПолучитьСоответствиеВидовОперацийФормам() Экспорт

	ФормыОприходованиеТоваров = Новый Соответствие;
	
	ФормыОприходованиеТоваров.Вставить(Перечисления.ВидыОперацийПеремещениеТоваров.ТоварыПродукция, 	    "ФормаДокументаОбщая");
	ФормыОприходованиеТоваров.Вставить(Перечисления.ВидыОперацийПеремещениеТоваров.Оборудование, 			"ФормаДокументаОбщая");
	ФормыОприходованиеТоваров.Вставить(Перечисления.ВидыОперацийПеремещениеТоваров.БланкиСтрогогоУчета, 	"ФормаДокументаОбщая");
	
	Возврат ФормыОприходованиеТоваров;

КонецФункции 

Функция ОпределитьВидОперацииПоДокументуОснованию(Основание) Экспорт

	Результат = Перечисления.ВидыОперацийПеремещениеТоваров.ТоварыПродукция;

	Возврат Результат;

КонецФункции

Функция ПолучитьФиксированныйМассивВидовОпераций() Экспорт

	МассивВидовОпераций = Новый Массив;
	СписокВидовОпераций = Новый СписокЗначений;
	
	ЗначенияПеречисления = Метаданные.Перечисления.ВидыОперацийПеремещениеТоваров.ЗначенияПеречисления;
	Для Каждого ЗначениеПеречисления Из ЗначенияПеречисления Цикл
		ТекущийВидОперации = Перечисления.ВидыОперацийПеремещениеТоваров[ЗначениеПеречисления.Имя];
		МассивВидовОпераций.Добавить(ТекущийВидОперации);
	КонецЦикла;
	
	Если НЕ ПолучитьФункциональнуюОпцию("ИспользоватьБланкиСтрогогоУчета") Тогда
		ИндексНайденныйЭлемент = МассивВидовОпераций.Найти(Перечисления.ВидыОперацийПеремещениеТоваров.БланкиСтрогогоУчета);
		Если ИндексНайденныйЭлемент <> Неопределено Тогда
    		МассивВидовОпераций.Удалить(ИндексНайденныйЭлемент);
		КонецЕсли;	
	КонецЕсли;
	
	Возврат Новый ФиксированныйМассив(МассивВидовОпераций);

КонецФункции // ПолучитьФиксированныйМассивВидовОпераций

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	//Если ВидФормы <> "ФормаДокумента"
	//	И ВидФормы <> "ФормаОбъекта" Тогда
	//	Возврат;
	//КонецЕсли;

	//ВидОперации = Неопределено; 

	//Если Параметры.Свойство("Ключ") И ЗначениеЗаполнено(Параметры.Ключ) Тогда
	//	ВидОперации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Параметры.Ключ, "ВидОперации");
	//КонецЕсли;

	//// Если документ копируется, то вид формы получаем из копируемого документа.
	//Если НЕ ЗначениеЗаполнено(ВидОперации) Тогда
	//	Если Параметры.Свойство("ЗначениеКопирования")
	//		И ЗначениеЗаполнено(Параметры.ЗначениеКопирования) Тогда
	//		ВидОперации = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(
	//			Параметры.ЗначениеКопирования, "ВидОперации");
	//	КонецЕсли;
	//КонецЕсли;

	//Если НЕ ЗначениеЗаполнено(ВидОперации) Тогда
	//	Если Параметры.Свойство("ЗначенияЗаполнения") 
	//		И ТипЗнч(Параметры.ЗначенияЗаполнения) = Тип("Структура") Тогда
	//		Если Параметры.ЗначенияЗаполнения.Свойство("ВидОперации") Тогда
	//			ВидОперации = Параметры.ЗначенияЗаполнения.ВидОперации;
	//		КонецЕсли;
	//	КонецЕсли;
	//КонецЕсли;
	//
	//Если НЕ ЗначениеЗаполнено(ВидОперации) Тогда
	//	Если Параметры.Свойство("Основание")
	//		И ЗначениеЗаполнено(Параметры.Основание) Тогда
	//		ВидОперации = ОпределитьВидОперацииПоДокументуОснованию(Параметры.Основание);
	//	КонецЕсли;
	//КонецЕсли;

	//СтандартнаяОбработка = Ложь;
	//ФормыПеремещениеТоваров = ПолучитьСоответствиеВидовОперацийФормам();
	//ВыбраннаяФорма = ФормыПеремещениеТоваров[ВидОперации];
	//Если ВыбраннаяФорма = Неопределено Тогда
	//	ВыбраннаяФорма = "ФормаДокумента";
	//КонецЕсли;
	
КонецПроцедуры // ОбработкаПолученияФормы

#КонецОбласти  

#КонецЕсли
